# EndNode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalSegment..::..EndNode Property
MEPAnalyticalSegment Class See Also
---
The id of the end analytical node.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int EndNode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndNode As Integer
	Get
```

Visual C++
---
```text
public:
property int EndNode {
	int get ();
}
```

# See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace